#include<iostream>
#include<ctime>
using namespace std;

int main()
{
	srand(time(0));
	setlocale(LC_ALL, "ru");
	// Задание № 1 и 4 =========================================================================================================================
	cout << "Задание № 4" << "\n";
	extern int a, b, c, d;
	extern float f;
	f = (a * (b + (static_cast <float>(c) / d)));
	cout << f << "\n\n";

	// Задание № 2  =========================================================================================================================
	cout << "Задание № 2" << "\n";
	int iRand = rand() % 42; //Назначаем целое число от 0 до 42
	cout << "Число для сверки: " << iRand << "\n"; //выводим это целое число 
	iRand = (iRand <= 21) ? (21 - iRand) : ((iRand - 21) * 2); //Сверяем число с 21 и перезаписываем его в зависимости от результата
	cout<< "Итоговый результат: " << iRand << "\n\n"; //выводим результат


	// Задание № 3 =========================================================================================================================
	cout << "Задание № 3" << "\n";
	const int  n = 3;
	const int  m = 3;
	const int  l = 3;
	int arr2[n][m][l];
	int number = 0;

	for (int j = 0; j < n; j++)
	{
		for (int i = 0; i < m; i++)
		{
			for (int k = 0; k < l; k++)
			{
				arr2[j][i][k] = number;
				number++;
				//cout << arr2[j][i][k] <<"\t";  Вывод массива.
			}
		}
	}
	cout << "\n\n";
	
	
	
	int x, y, z;
	int* ptr = &arr2[0][0][0];

	cout << "с помощью указателя выводим элемент массива arr2[1][1][1]:\t" << *(ptr + ((1 * m * l) + (1 * l) + 1)) << "\n\n";
	cout << "для проверки выведем число arr2[1][1][1] напрямую:\t\t"<< arr2[1][1][1] << "\n\n";

	/*
	cout << "теперь для теста можно вывести любой элемент из массива какой хочется, для этого надо ввести x y z\n но не большие чем размер (массива-1)\nт.е. если размер массива 3, то максимальное число = 2\n\n";
	for (int i = 0; i < 10; i++)
	{
		cout << "\n" << "введите число х: ";
		cin >> x;
		cout << "\n" << "введите число y: ";
		cin >> y;
		cout << "\n" << "введите число z: ";
		cin >> z;
		cout << "\n\n";
		cout << "Значение рассчитано по формуле: *(ptr + (((x * m) + y) * l + z)):\t " << *(ptr + (((x * m) + y) * l + z)) << "\n";
		cout << "для проверки выведем значение arr2[x][y][z] напрямую:\t\t\t " << arr2[x][y][z] << "\n";
	
	}
	*/
	//=========================================================================================================================


}